html/stats-for-hackers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Statistics for Hackers</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Statistics for Hackers</h1>
<p>
<a href="https://speakerdeck.com/jakevdp/statistics-for-hackers">https://speakerdeck.com/jakevdp/statistics-for-hackers</a>
</p>

<p>
In general:
</p>
<ol class="org-ol">
<li>Computing the Sampling Distribution is Hard.（计算采样分布很难）
</li>
<li>Simulating the Sampling Distribution is Easy.（但是通过计算机模拟采样分布却很容易）
</li>
</ol>

<p>
Four Recipes for Hacking Statistics:
</p>
<ol class="org-ol">
<li>Direct Simulation. 前提是我们知道数据生成模型
</li>
<li>Shuffling.
</li>
<li>Bootstrapping.
</li>
<li>Cross Validation.
</li>
</ol>

<p>
统计学使用的方法是：
</p>
<ol class="org-ol">
<li>我们首先做空假设(null hypothesis)
</li>
<li>在这个前提下我们通过计算/模拟来观察结果的显著性(significance)
</li>
<li>显著性是以p-value/置信区间(confidence interval)相关为前提的
</li>
<li>如果观察是显著的话，那么我们就可以推翻空假设。反之我们就认同空假设。
</li>
</ol>

<p>
我们需要区分显著性(significance)和重要性(importance)的差别：
</p>
<blockquote>
<p>
Significance vs. Importance
</p>
<ul class="org-ul">
<li>Suppose that we try a different drug/placebo experiment on 1 million patients and the drug increases life by 5 years and 3 days whereas the placebo increases life by 5 years alone.
</li>
<li>This might, because of the large sample size, give a low p-value (thus statistically significant).
</li>
<li>But is it important? Do we care? Please ask this question.
</li>
</ul>
</blockquote>

<p>
另外选取p-value/confidence-interval需要根据情况选择。社会和人为变量的分布，通常比自然变量的分布更广。
比如人的资产分布，因为马太效应，通常呈现的是帕累托分布。
</p>
<blockquote>
<p>
Social vs. Natural
</p>
<ul class="org-ul">
<li>Confidence intervals tend to vary more for social/cultural phenomena than natural ones:  people’s weights vary by a factor of maybe 20, but incomes can vary by a factor of 1000 or more.
</li>
<li>More important: in human affairs, past behavior is a bad predictor of future behavior (e.g. German Mark vs. Dollar in the early 1920s).
</li>
<li>See Nassim Taleb’s book: The Black Swan
</li>
</ul>
</blockquote>
</div>
</body>
</html>
